---
kind: method
id: M:Autodesk.Revit.DB.CompoundStructureLayer.#ctor
source: html/4f96e798-f9f3-f4bc-400a-144aca23d844.htm
---
# Autodesk.Revit.DB.CompoundStructureLayer.#ctor Method

Creates a compound structure layer using default settings.

## Syntax (C#)
```csharp
public CompoundStructureLayer()
```

## Remarks
Note that the combination of the default values does not create a completely valid CompoundStructureLayer.
 You should change the necessary values before adding to a CompoundStructure.